## Panda compare to MS Excel

Dataframe -> worksheet
Series ->    Column
Index  ->     Row header
Row    ->    Row
NaN    ->    empty cell

### Dataframe from an array

In [44]:
import pandas as pd
import numpy as np

In [6]:
data = np.array([["Eden", 16],["Oby",18],["Eze",19]])

In [7]:
data

array([['Eden', '16'],
       ['Oby', '18'],
       ['Eze', '19']], dtype='<U11')

In [16]:
df = pd.DataFrame(data, columns=["Name","Age"])

In [17]:
df

   Name Age
0  Eden  16
1   Oby  18
2   Eze  19

In [19]:
df.Name

0    Eden
1     Oby
2     Eze
Name: Name, dtype: object

In [20]:
data1 = np.array([["Apple",4,10],["Kiwi",1,10], ["Banana",2,8],["Orange",2.3,11],["Mango",0.5,6.50]])

In [21]:
data1

array([['Apple', '4', '10'],
       ['Kiwi', '1', '10'],
       ['Banana', '2', '8'],
       ['Orange', '2.3', '11'],
       ['Mango', '0.5', '6.5']], dtype='<U32')

In [22]:
df = pd.DataFrame(data1,columns=["Item","weight in Kg","Cost"])
df

     Item weight in Kg Cost
0   Apple            4   10
1    Kiwi            1   10
2  Banana            2    8
3  Orange          2.3   11
4   Mango          0.5  6.5

### DataFrame from a list

In [23]:
##creating dataframe without numpy but from list
data_holder = [["Apple",4,10],["Grape",1,10], ["Lemon",2,8],["Orange",2.3,11],["Watermelon",0.5,6.50]]
df2 = pd.DataFrame(data_holder,columns=["Fruits","in Kg","Cost"])
df2

       Fruits  in Kg  Cost
0       Apple    4.0  10.0
1       Grape    1.0  10.0
2       Lemon    2.0   8.0
3      Orange    2.3  11.0
4  Watermelon    0.5   6.5

### DataFrame from a Dictionary

In [27]:
##creating dataframe from dictionary data type
States = ["California"
            ,"Texas"
            ,"Florida"
            ,"New York"
            ,"Pennsylvania"
            ,"llinois"]
Population = [39937489
              ,29472295
              ,21992985
              ,19440469
              ,12820878
              ,12659682]

dict_1 = {"states":States, 
          "population":Population}

df3 = pd.DataFrame(dict_1)
df3

         states  population
0    California    39937489
1         Texas    29472295
2       Florida    21992985
3      New York    19440469
4  Pennsylvania    12820878
5       llinois    12659682

In [31]:
import os
os.getcwd()

'C:\\Users\\48502\\Documents\\BI and ETL Training\\Training\\python data analysis\\pythonJupyterDataAnalysis'

In [33]:
pwd

'C:\\Users\\48502\\Documents\\BI and ETL Training\\Training\\python data analysis\\pythonJupyterDataAnalysis'

### DataFrame from a CSV file

In [45]:
df_studentData = pd.read_csv("StudentsPerformanceData.csv")

In [46]:
df_studentData.tail()

    gender;race/ethnicity;parental level of education;lunch;test preparation course;math score;reading score;writing score
995  female;group E;master's degree;standard;comple...
996  male;group C;high school;free/reduced;none;62;...
997  female;group C;high school;free/reduced;comple...
998  female;group D;some college;standard;completed...
999  female;group D;some college;free/reduced;none;...

In [55]:
### Detail documentation about csv loading parameter - https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
dataset = pd.read_csv("DataSample.csv",delimiter=";")

In [56]:
dataset.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [57]:
dataset

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [63]:
top20_row = dataset.head(n=20)

In [61]:
last20_row = dataset.tail(n=20)

In [69]:
subset = top20_row.append(last20_row)

In [70]:
subset.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [71]:
subset

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50
10,male,group C,associate's degree,standard,none,58,54,52
11,male,group D,associate's degree,standard,none,40,52,43
12,female,group B,high school,standard,none,65,81,73
13,male,group A,some college,standard,completed,78,72,70
14,female,group A,master's degree,standard,none,50,53,58
15,female,group C,some high school,standard,none,69,75,78
16,male,group C,high school,standard,none,88,89,86
17,female,group B,some high school,free/reduced,none,18,32,28
18,male,group C,master's degree,free/reduced,completed,46,42,46
19,female,group C,associate's degree,free/reduced,none,54,58,61
980,female,group B,high school,free/reduced,none,8,24,23
981,male,group D,some high school,standard,none,81,78,78
982,male,group B,some high school,standard,completed,79,85,86
983,female,group A,some college,standard,completed,78,87,91
984,female,group C,some high school,standard,none,74,75,82
985,male,group A,high school,standard,none,57,51,54
986,female,group C,associate's degree,standard,none,40,59,51
987,male,group E,some high school,standard,completed,81,75,76
988,female,group A,some high school,free/reduced,none,44,45,45
989,female,group D,some college,free/reduced,completed,67,86,83
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
994,male,group A,high school,standard,none,63,63,62
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [84]:
##summary of the first dataset studentperformance
round(dataset.describe(),2)

       math score  reading score  writing score
count     1000.00        1000.00        1000.00
mean        66.09          69.17          68.05
std         15.16          14.60          15.20
min          0.00          17.00          10.00
25%         57.00          59.00          57.75
50%         66.00          70.00          69.00
75%         77.00          79.00          79.00
max        100.00         100.00         100.00

In [83]:
##summary of the subset data
round(subset.describe(),2)

       math score  reading score  writing score
count       40.00          40.00          40.00
mean        62.88          69.32          67.68
std         18.81          17.90          18.37
min          8.00          24.00          23.00
25%         53.00          56.50          53.50
50%         65.00          73.50          74.00
75%         77.25          82.25          79.00
max         90.00          99.00          95.00

In [77]:
## gives data size in row and column order
dataset.shape

(1000, 8)

In [78]:
subset.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
             13,  14,  15,  16,  17,  18,  19, 980, 981, 982, 983, 984, 985,
            986, 987, 988, 989, 990, 991, 992, 993, 994, 995, 996, 997, 998,
            999],
           dtype='int64')

In [81]:
dataset.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [82]:
dataset.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

### Groupby and Aggregate Function

In [86]:
##grouping and aggregate function in DataFrame
male_female = dataset.groupby("gender")

In [87]:
male_female

In [89]:
male_female.count()

,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
gender,,,,,,,
female,518,518,518,518,518,518,518
male,482,482,482,482,482,482,482

In [93]:
male_female.mean()

        math score  reading score  writing score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [94]:
%config Completer.use_jedi = False

In [95]:
male_female.std()

        math score  reading score  writing score
gender
female   15.491453      14.378245      14.844842
male     14.356277      13.931832      14.113832

### Selecting Column in DataFrame

In [96]:
dataset["math score"].mean()

66.089

In [97]:
male_female["math score"].mean()

gender
female    63.633205
male      68.728216
Name: math score, dtype: float64

In [99]:
dataset[["gender","math score"]]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [98]:
###second method of selecting a column is more appropriate if the column name contain no space
dataset.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

### Adding new Column to DataFrame

In [100]:
studentID = np.arange(0,1000)

In [101]:
len(studentID)

1000

In [102]:
dataset["Student ID"] = studentID

In [103]:
dataset

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Student ID
0,female,group B,bachelor's degree,standard,none,72,72,74,0
1,female,group C,some college,standard,completed,69,90,88,1
2,female,group B,master's degree,standard,none,90,95,93,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,3
4,male,group C,some college,standard,none,76,78,75,4
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,995
996,male,group C,high school,free/reduced,none,62,55,55,996
997,female,group C,high school,free/reduced,completed,59,71,65,997
998,female,group D,some college,standard,completed,68,78,77,998
999,female,group D,some college,free/reduced,none,77,86,86,999

In [104]:
GrandTotal = dataset["math score"] + dataset["reading score"] + dataset["reading score"]

In [105]:
GrandTotal

0      216
1      249
2      280
3      161
4      232
      ...
995    286
996    172
997    201
998    224
999    249
Length: 1000, dtype: int64

In [106]:
dataset["grand total"] = GrandTotal

In [107]:
dataset

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Student ID,grand total
0,female,group B,bachelor's degree,standard,none,72,72,74,0,216
1,female,group C,some college,standard,completed,69,90,88,1,249
2,female,group B,master's degree,standard,none,90,95,93,2,280
3,male,group A,associate's degree,free/reduced,none,47,57,44,3,161
4,male,group C,some college,standard,none,76,78,75,4,232
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,995,286
996,male,group C,high school,free/reduced,none,62,55,55,996,172
997,female,group C,high school,free/reduced,completed,59,71,65,997,201
998,female,group D,some college,standard,completed,68,78,77,998,224
999,female,group D,some college,free/reduced,none,77,86,86,999,249

In [108]:
GrandTotal.max()

300